{
    "date": "actualidad",
    "nav-1": "Inicio",
    "nav-2": "Web",
    "nav-3": "Juegos",
    "dev": "Desarrollador FullStack",
    "mail": "Correo",
    "title-lang": "Selector de idioma",
    "lang-es": "Español",
    "lang-en": "Inglés",
    "error_message": "Página no encontrada",
    "error_back": "Volver a la página de inicio",
    "footer_title": "Explorar",
    "footer_title_2": "Redes",
    "back_button": "↩ Volver",
    "aboutMe_a1_title": "Sobre mí",
    "aboutMe_a1_text": "Desarrollador FullStack enfocado en .NET y Azure, con experiencia en React, gestión de bases de datos y IA generativa (Azure OpenAI). Además, cuento con experiencia en el desarrollo de videojuegos independientes. En las pestañas superiores, puedes explorar algunos de mis proyectos destacados.",
    "aboutMe_a2_title": "Habilidades técnicas",
    "aboutMe_a3_title": "Experiencia laboral",
    "aboutMe_a3_subtitle": "Desarrollador de Soluciones en la Nube con IA",
    "aboutMe_a3_text": "Desarrollo e investigación de soluciones con Azure OpenAI y GPT. Participación en proyectos que incluyen sistemas de preguntas y respuestas sobre documentos, resúmenes en tiempo real, etc.",
    "aboutMe_a3_text_2": "Creación de chatbots utilizando Azure Bot y Bot Framework.",
    "aboutMe_a4_title": "Más información",
    "aboutMe_a4_subtitle": "Idiomas",
    "aboutMe_a4_text": "Español",
    "aboutMe_a4_text_2": "Catalán",
    "aboutMe_a4_text_3": "Inglés",
    "aboutMe_a4_subtitle_2": "Estudios",
    "aboutMe_a4_study": "Desarrollo de aplicaciones web",
    "aboutMe_a4_study_2": "Bachillerato tecnológico",
    "aboutMe_a5_title": "Certificados",
    "aboutMe_a5_link": "Ver credencial",
    "games_a1_title": "Juegos",
    "game_dx_link": "Ver más",
    "game_d1_text": "Leaving The After Party es un videojuego lineal desarrollado en Unity para jugar en la web con WebGL.",
    "game_d2_text": "ARMansion es un videojuego de estilo \"Scape Room\" desarrollado en Unity con Realidad Aumentada integrada mediante Vuforia.",
    "game_common_h2_1": "Tecnologías",
    "game_common_h2_2": "Enlaces",
    "game_common_h2_3": "Demo",
    "game_armansion_text": "ARMansion representa un proyecto final de bachillerato, que utiliza Unity, C# y Vuforia para crear una experiencia de juego con Realidad Aumentada.",
    "game_armansion_text_2": "El juego consiste en escapar de una mansion en la que el jugador está encerrado. Para poder ir accediendo a nuevas secciones de la misma, tendrá que resolver diferentes pruebas.",
    "game_armansion_text_3": "Por otro lado, ha sido desarrollado para dispositivos moviles, concretamente de la plataforma Android. Esto se debe, a que hace uso de diferentes elementos como la camara del dispositivo para la parte de Realidad Aumentada, el microfono, giroscopio, etc.",
    "game_armansion_text_4.1": "Es una plataforma de desarrollo en tiempo real para crear videojuegos y contenido interactivo en 2D y 3D, conocida por su flexibilidad y soporte para múltiples plataformas.",
    "game_armansion_text_4.2": "Es un lenguaje de programación orientado a objetos, fuertemente tipado y de propósito general. Tiene una alta compatibilidad con Unity.",
    "game_armansion_text_4.3": "Es una aplicacion que permite realizar diseño de mapas utilizando \"tiles\" y colisiones. Es muy utilizado en el desarrollo de videojuegos 2D.",
    "game_armansion_text_4.4": "Es un motor de renderizado de Realidad Aumentada, que permite a los desarrolladores crear experiencias de Realidad Aumentada de alta calidad para dispositivos móviles y de escritorio.",
    "game_armansion_text_5": "Descargar APK",
    "game_armansion_text_6": "Video en Youtube",
    "game_armansion_text_7": "Código fuente en Github",
    "game_armansion_text_8": "Documentación del proyecto (CAT)",
    "game_ltap_text": "Leaving The After Party marca la finalización de un curso de desarrollo de aplicaciones web. Es un videojuego de Unity y C#, que se puede jugar online a través de WebGL. Muestra una fusión de habilidades de programación y diseño de juegos en un entorno práctico.",
    "game_ltap_text_2": "El juego consiste en un personaje que debe escapar de una fiesta, evitando obstáculos y enemigos. A medida que avanza se irá encontrando diferentes personajes con los cuales interactuar. El objetivo es regresar a casa sano y salvo.",
    "game_ltap_text_4.1": "Una plataforma de desarrollo de juegos que permite a los desarrolladores crear experiencias interactivas en 2D, 3D y VR, ampliamente utilizada para juegos, simulaciones y aplicaciones en tiempo real.",
    "game_ltap_text_4.2": "Un lenguaje de programación moderno y orientado a objetos desarrollado por Microsoft, comúnmente utilizado para desarrollar aplicaciones en la plataforma .NET. Tiene alta compatibilidad con Unity.",
    "game_ltap_text_4.3": "Un editor de mapas de código abierto utilizado para diseñar niveles basados en mosaicos para juegos en 2D, compatible con varios frameworks y motores de desarrollo de juegos como Unity.",
    "game_ltap_text_4.4": "Un lenguaje de scripts del lado del servidor diseñado para el desarrollo web, utilizado para crear páginas web dinámicas e interactivas.",
    "game_ltap_text_4.5": "Un sistema de gestión de bases de datos relacional desarrollado por Microsoft, utilizado para almacenar y recuperar datos en varias aplicaciones.",
    "game_ltap_text_4.6": "Una plataforma de computación en la nube de Microsoft que ofrece una amplia gama de servicios, incluidos máquinas virtuales, bases de datos, IA y más, para crear aplicaciones escalables.",
    "game_ltap_text_5": "Código fuente en Github",
    "game_ltap_text_6": "Jugar",
    "web_a1_title": "Web",
    "web_d1_text": "Una pequeña API de C# que integra elementos de IA, Semantic Kernel y una base de datos vectorial como Qdrant.",
    "web_common_h2_1": "Tecnologías",
    "web_common_h2_2": "Enlaces",
    "web_openai_hramos_text": "Durante mis prácticas en ENCAMINA, he desarrollado una API de aprendizaje con múltiples endpoints para explorar y probar diversos servicios, como patrones RAG (Retrieve-Augment-Generate), almacenamiento de datos en bases de datos vectoriales como Qdrant, el uso de Semantic Kernel, entre otros. Todo ello se encuentra integrado con recursos en la nube proporcionados por Azure.",
    "web_openai_hramos_text_2": "Para utilizar la API, es necesario contar con un grupo de recursos en Azure, que incluya un recurso de Azure OpenAI y una Web App con Qdrant. Además, se deberá configurar un archivo de ajustes que contenga las claves de acceso para los servicios correspondientes.",
    "web_openai_hramos_text_3": "La API tiene diferentes endpoints para interactuar con los servicios. Por ejemplo, hay un endpoint para generar texto basado en un aviso, otro para recuperar información de un documento y otro para almacenar datos en una base de datos vectorial.",
    "web_openai_hramos_text_4": "Por otro lado, también contiene endpoints que han sido diseñados para mejorar funciones que más tarde se incluirán en la biblioteca ENCAMINA llamada"
}