{
    "date": "nowdays",
    "nav-1": "Home",
    "nav-2": "Web",
    "nav-3": "Games",
    "dev": "FullStack Developer",
    "mail": "Mail",
    "title-lang": "Language selector",
    "lang-es": "Spanish",
    "lang-en": "English",
    "error_message": "Page not found",
    "error_back": "Return to homepage",
    "footer_title": "Explore",
    "footer_title_2": "Networks",
    "back_button": "↩ Back",
    "aboutMe_a1_title": "About me",
    "aboutMe_a1_text": "Web developer focused on .NET, Azure and Generative Artificial Intelligence. In addition, I have experience in developing small video games. In the tabs above, you can explore some of my work.",
    "aboutMe_a2_title": "Technical skills",
    "aboutMe_a3_title": "Work experience",
    "aboutMe_a3_subtitle": "Cloud Solutions Developer with AI",
    "aboutMe_a3_text": "Development and research of solutions with Azure OpenAI and GPT. Participation in projects that include question and answer systems on documents, real-time summaries, etc.",
    "aboutMe_a3_text_2": "Creating chatbots using Azure Bot y Bot Framework.",
    "aboutMe_a4_title": "More information",
    "aboutMe_a4_subtitle": "Languages",
    "aboutMe_a4_text": "Spanish",
    "aboutMe_a4_text_2": "Catalan",
    "aboutMe_a4_text_3": "English",
    "aboutMe_a4_subtitle_2": "Studies",
    "aboutMe_a4_study": "Web applications development",
    "aboutMe_a4_study_2": "Technological baccalaureate",
    "aboutMe_a5_title": "Certificates",
    "aboutMe_a5_link": "View credential",
    "games_a1_title": "Games",
    "game_dx_link": "See more",
    "game_d1_text": "Leaving The After Party is a linear video game developed in Unity to play on the web with WebGL.",
    "game_d2_text": "ARMansion is a \"Scape Room\" style videogame developed in Unity with Augmented Reality integrated through Vuforia.",
    "game_common_h2_1": "Technologies",
    "game_common_h2_2": "Links",
    "game_armansion_text": "ARMansion represents a high school final project that uses Unity, C#, and Vuforia to create an Augmented Reality gaming experience.",
    "game_armansion_text_2": "The game involves escaping from a mansion in which the player is trapped. To access new sections of the mansion, the player must solve various challenges.",
    "game_armansion_text_3": "Additionally, it has been developed for mobile devices, specifically for the Android platform. This is because it uses various elements such as the device's camera for the Augmented Reality part, microphone, gyroscope, etc.",
    "game_armansion_text_4.1": "It is a real-time development platform for creating video games and interactive 2D and 3D content, known for its flexibility and support for multiple platforms.",
    "game_armansion_text_4.2": "It is a strongly typed, object-oriented, general-purpose programming language. It has high compatibility with Unity.",
    "game_armansion_text_4.3": "It is an application that allows map design using 'tiles' and collisions. It is widely used in 2D video game development.",
    "game_armansion_text_4.4": "It is an Augmented Reality rendering engine that allows developers to create high-quality Augmented Reality experiences for mobile and desktop devices.",
    "game_armansion_text_5": "Download APK",
    "game_armansion_text_6": "Video on YouTube",
    "game_armansion_text_7": "Source code on GitHub",
    "game_armansion_text_8": "Project documentation (CAT)",
    "game_ltap_text": "Leaving The After Party marks the completion of a web application development course. It is a video game made with Unity and C# that can be played online through WebGL. It showcases a blend of programming and game design skills in a practical setting.",
    "game_ltap_text_2": "The game involves a character who must escape a party, avoiding obstacles and enemies. As the player progresses, they will encounter different characters to interact with. The goal is to return home safely.",
    "game_ltap_text_4.1": "A game development platform that enables developers to create interactive 2D, 3D, and VR experiences, widely used for gaming, simulations, and real-time apps.",
    "game_ltap_text_4.2": "A modern, object-oriented programming language developed by Microsoft, commonly used for developing applications on the .NET platform. Has high compatibility with Unity.",
    "game_ltap_text_4.3": "An open-source map editor used to design tile-based levels for 2D games, compatible with various game development frameworks and engines like Unity.",
    "game_ltap_text_4.4": "A server-side scripting language designed for web development, used to create dynamic and interactive web pages.",
    "game_ltap_text_4.5": "A relational database management system developed by Microsoft, used to store and retrieve data for various applications.",
    "game_ltap_text_4.6": "A cloud computing platform by Microsoft offering a wide range of services including virtual machines, databases, AI, and more for building scalable applications.",
    "game_ltap_text_5": "Source code on GitHub",
    "game_ltap_text_6": "Play",
    "web_a1_title": "Web",
    "web_d1_text": "A small C# API integrating AI elements, a Semantic Kernel, and vector database like Qdrant.",
    "web_common_h2_1": "Technologies",
    "web_common_h2_2": "Links",
    "web_openai_hramos_text": "During my internship at ENCAMINA, I developed a learning API with multiple endpoints to explore and test various services, such as RAG patterns (Retrieve-Augment-Generate), data storage in vector databases like Qdrant, the use of Semantic Kernel, among others. All of this is integrated with cloud resources provided by Azure.",
    "web_openai_hramos_text_2": "To use the API, it is necessary to have a resource group in Azure that includes an Azure OpenAI resource and a Web App with Qdrant. Additionally, a configuration file must be set up with the access keys for the corresponding services.",
    "web_openai_hramos_text_3": "The API has different endpoints to interact with the services. For example, there is an endpoint to generate text based on a prompt, another to retrieve information from a document, and another to store data in a vector database.",
    "web_openai_hramos_text_4": "On the other hand, it also contains Endpoints that allow have been designed to improve functions that will later be included in the ENCAMINA library called"
}